dnd-character-creator-api/app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters"
---
  def index
    p "Character index route accessed"
    @characters = Character.all

INSERT INTO "characters" ("name", "race", "character_class", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "asdfasdf"], ["race", 7], ["character_class", 0], ["created_at", "2020-02-15 16:59:42.802261"], ["updated_at", "2020-02-15 16:59:42.802261"]]
---
  def create
    p "Character create route accessed"
    @character = Character.new(character_params)

    if @character.save

UPDATE "characters" SET "name" = $1, "updated_at" = $2 WHERE "characters"."id" = $3  [["name", "NAME CHANGED"], ["updated_at", "2020-02-12 02:55:40.700760"], ["id", 2]]
---
  def update
    p "Character update route accessed"

    if @character.update(character_params)

DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 1]]
---
  def destroy
    p "Character destroy route accessed"
    render json: @character.destroy()